app/Controllers/api/Buku.php

SELECT *
FROM `buku`
WHERE `id_penerbit` = 'PARAD'
ORDER BY `id_buku` DESC
 LIMIT 1
---
    public function create()
    {

        $id_penerbit = strtoupper($this->request->getJsonVar('id_penerbit'));

        $data = [
            'id_penerbit'      => $id_penerbit,
            'judul'            => $this->request->getJsonVar('judul'),
            'penulis'          => $this->request->getJsonVar('penulis'),
            'harga'            => $this->request->getJsonVar('harga'),
            'stok'             => $this->request->getJsonVar('stok'),
            'cover'            => $this->request->getJsonVar('cover')
        ];
        //    cari id buku terakhir berdasarkan id_penerbit
        $lastBook = $this->buku->where('id_penerbit', $id_penerbit)->orderBy('id_buku', 'DESC')->first();

INSERT INTO `buku` (`id_penerbit`, `judul`, `penulis`, `harga`, `stok`, `cover`, `id_buku`, `created_at`, `updated_at`) VALUES ('PARAD', 'Korupsi Desa', 'Mason Mount', '90000.00', '11', 'default.jpg', 'PARAD002', '2023-10-09 11:54:52', '2023-10-09 11:54:52')
---
               ]
           ]);

           if(!$this->buku->save($data)){