app/Controllers/api/Penerbit.php

    public function index($id = null)
    {
        // $page   = $this->request->getVar('page') ?? 1;
        // $limit  = $this->request->getVar('limit') ?? 6;
        // $urut  = $this->request->getVar('urut') ?? 'DESC';
        $page   = $this->request->getGet('page') ?? 1;
        $limit  = $this->request->getGet('limit') ?? 2;
        $urut  = $this->request->getGet('urut') ?? 'DESC';
        if ($id)
        {
            $data = $this->penerbit->where('id', $id)->first();
            return $this->respond($data, 200);
        }
        // $data = $this->penerbit->orderBy('id', 'DESC')->findAll();
        $data = $this->penerbit->orderBy('id', $urut)->paginate($limit, 'default', $page);
---
SELECT *
FROM `penerbit`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `penerbit`
ORDER BY `id` DESC
 LIMIT 2, 2
SELECT COUNT(*) AS `numrows`
FROM `penerbit`

    public function create()
    {

        $data = [
         'id_penerbit'      => strtoupper($this->request->getJsonVar('id_penerbit')),
         'nama_penerbit'    => $this->request->getJsonVar('nama_penerbit'),
         'no_hp'            => $this->request->getJsonVar('no_hp'),
         'prov'             => $this->request->getJsonVar('prov'),
         'kota'             => $this->request->getJsonVar('kota'),
         'kec'              => $this->request->getJsonVar('kec'),
         'kel'              => $this->request->getJsonVar('kel'),
         'kode_pos'         => $this->request->getJsonVar('kode_pos'),
         'alamat'           => $this->request->getJsonVar('alamat')
        ];
        $this->penerbit->setValidationRules([
            'id_penerbit'       => 'required|is_unique[penerbit.id_penerbit]',
            'nama_penerbit'     => 'required|is_unique[penerbit.nama_penerbit]']);
        $this->penerbit->setValidationMessages([
            'id_penerbit'       => [
                'required'      => 'silahkan masukan id penerbit',
                'is_unique'     => 'id sudah dipakai',
            ],
            'nama_penerbit'     => [
                'required'      => 'silahkan masukan nama penerbit',
                'is_unique'     => 'nama penerbit sudah dipakai'
            ]
        ]);
        if(!$this->penerbit->save($data))
---
INSERT INTO `penerbit` (`id_penerbit`, `nama_penerbit`, `no_hp`, `prov`, `kota`, `kec`, `kel`, `kode_pos`, `alamat`, `created_at`, `updated_at`) VALUES ('THAFA', 'Thafa Media', '088111222333', 'Daerah Istimewa Yogyakarta', 'Sleman', NULL, '44444', NULL, 'alamat lengkap', '2023-10-09 11:27:49', '2023-10-09 11:27:49')