app/Controllers/api/Penjualan.php

SELECT MAX(`id_penjualan`) AS `last_id_penjualan`
FROM `penjualan`
SELECT *
FROM `buku`
WHERE `id_buku` = 'NUMED001'
---
    public function create()
    {

        // validasi di tabel temp ada data atau tidak
        $temp = $this->tabeltemp->selectMax('id_penjualan', 'last_id_penjualan')->get()->getRow()->last_id_penjualan;
        $penjualan = $this->penjualan->selectMax('id_penjualan', 'last_id_penjualan')->get()->getRow()->last_id_penjualan;

        // jika di tabel temp dan penjualan kosong
        if($temp === null && $penjualan === null)
        {
            $resultgenerate = 'CUST00001';
        }

        // jika $temp nya kosong dan tabel penjualannnya ada
        elseif($temp === null && $penjualan !== null)
        {
                // $sequence = 1;
                $sequence = intval(substr($penjualan, -5)) + 1;
                $generateidpenjualan = sprintf("%05d", $sequence);
                $resultgenerate = 'CUST' . $generateidpenjualan;
        }
        // jika di tabel temp ada
        elseif ($temp !== null)
        {
            $resultgenerate = $temp;
        }

        // validasi id_buku ada di tabel buku tidak
        $id_buku = $this->request->getJsonVar('id_buku');

        $rowbuku = $this->buku->where('id_buku', $id_buku)->get()->getResultArray();

SELECT `harga`
FROM `buku`
WHERE `id_buku` = 'NUMED001'
---
            return $this->fail('jumlah buku harus angka');
        }

        $hargabuku = $this->buku->select('harga')->where('id_buku', $id_buku)->get()->getRow()->harga;

INSERT INTO `penjualan` (`id_penjualan`, `total`, `created_at`, `updated_at`) VALUES ('CUST00001', '180000.00', '2023-10-09 13:29:19', '2023-10-09 13:29:19')
---
    public function simpanPenjualan()
    {
        // simpan data di tabel penjualan
        $id_penjualan = $this->tabeltemp->selectMax('id_penjualan', 'last_id_penjualan')->get()->getRow()->last_id_penjualan;
        $total = $this->tabeltemp->selectSum('subtotal', 'sum_subtotal')->get()->getRow()->sum_subtotal;
        $datapenjualan = [
            'id_penjualan'  => $id_penjualan,
            'total'         => $total
        ];

        $temp = $this->tabeltemp->select('*')->get()->getResultArray();

        // jika data temp tidak ada
        if(!$temp)
        {
            return $this->fail('input buku yang jual');
        }

        // validasi simpan penjualan
        if(!$this->penjualan->save($datapenjualan))

SELECT `stok`
FROM `buku`
WHERE `id_buku` = 'NUMED001'
UPDATE `buku` SET `stok` = 10, `updated_at` = '2023-10-09 13:29:19'
WHERE `id_buku` = 'PARAD002'
INSERT INTO `detailpenjualan` (`id_penjualan`, `id_buku`, `jumlah`, `subtotal`, `created_at`, `updated_at`) VALUES ('CUST00001', 'NUMED001', '2', '90000.00', '2023-10-09 13:29:19', '2023-10-09 13:29:19')
---
            ];

            //kurangi stok di tabel buku
            $stok = $this->buku->select('stok')->where('id_buku', $id_buku)->get()->getRow()->stok;
            $resultstok = $stok - $jumlah;
            $this->buku->where('id_buku', $id_buku)->set('stok', $resultstok)->update();

            //simpan data ke tabel detailpenjualan
            $this->detailpenjualan->save($data);

SELECT *
FROM `penjualan`
ORDER BY `created_at` DESC
---
        $response = [
            'status'    => 201,
            'error'     => null,
            'messages'  => [
                'success' => $this->penjualan->orderBy('created_at', 'DESC')->get()->getRow()
            ]