app/Models/BukuModel.php

SELECT COUNT(*) AS `numrows`
FROM `buku`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit`=`buku`.`id_penerbit`
SELECT `buku`.`id`, `buku`.`id_penerbit`, `buku`.`id_buku`, `buku`.`judul`, `penerbit`.`nama_penerbit`, `buku`.`penulis`, `buku`.`harga`, `buku`.`stok`, `buku`.`cover`, `buku`.`created_at`, `buku`.`updated_at`
FROM `buku`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit`=`buku`.`id_penerbit`
ORDER BY `id` DESC
 LIMIT 1, 1
---
    public function tampildata($limit, $page, $urut)
    {
        return $this->table('buku')->select('buku.id, buku.id_penerbit, buku.id_buku, buku.judul, penerbit.nama_penerbit, buku.penulis, buku.harga, buku.stok, buku.cover, buku.created_at, buku.updated_at')->join('penerbit', 'penerbit.id_penerbit=buku.id_penerbit', 'LEFT')->orderBy('id', $urut)->paginate($limit, 'default', $page);