app/Models/DetailPenjualanModel.php

    public function tampildata($limit, $page, $urut)
    {
        return $this->table('detailpenjualan')->select('*')->orderBy('id', $urut)->paginate($limit, 'default', $page);
---
SELECT *
FROM `detailpenjualan`
ORDER BY `id` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `detailpenjualan`