app/Models/PenjualanModel.php

SELECT *
FROM `penjualan`
ORDER BY `id` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `penjualan`
---
    public function tampildata($limit, $page, $urut)
    {
        return $this->table('penjualan')->select('*')->orderBy('id', $urut)->paginate($limit, 'default', $page);