app/Models/TempDetailPenjualanModel.php

    public function tampildata($limit, $page, $urut)
    {
        return $this->table('tempdetailpenjualan')->select('*')->orderBy('id', $urut)->paginate($limit, 'default', $page);
---
SELECT *
FROM `tempdetailpenjualan`
ORDER BY `id` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `tempdetailpenjualan`